{
  "backend/main.mo": "Motoko actor implementing authorization, user profiles, and an enquiry system with submission, admin retrieval, deletion, and pagination.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to file paths, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend file roles including layout, sections, hooks, admin components, and styling setup.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, radius, and dark/light theme variables with global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for home and admin pages with layout and theme provider.",
  "frontend/src/components/admin/EnquiriesList.tsx": "Admin list component showing enquiries with timestamps, details, delete dialog, and loading/error states.",
  "frontend/src/components/auth/AdminGuard.tsx": "Wrapper enforcing Internet Identity authentication and admin checks, showing loading, login prompt, or access denied.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrated with Internet Identity, handling status, errors, and query cache clearing.",
  "frontend/src/components/enquiry/EnquiryForm.tsx": "A form component that validates enquiry input fields and submits data using a custom hook, showing success or error alerts accordingly.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, quick-scroll links, social icons, and copyright text.",
  "frontend/src/components/layout/Header.tsx": "Displays a sticky header with logo navigation, smooth-scroll menu items, and a mobile collapsible menu.",
  "frontend/src/components/sections/AboutSection.tsx": "Shows an about section highlighting key features of the tuition centre using icon cards.",
  "frontend/src/components/sections/ClassesSubjectsSection.tsx": "Lists class groups with descriptions and subjects offered, displayed in styled cards.",
  "frontend/src/components/sections/EnquirySection.tsx": "Wraps and presents the enquiry form within a styled section with heading text.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with title, description, calls to action, and a decorative hero image.",
  "frontend/src/components/sections/TeachingApproachSection.tsx": "Outlines the teaching approach through a list of methods and an accompanying illustrative image.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useEnquiriesAdmin.ts": "Provides admin enquiry queries and mutations using the actor, including fetching, deleting, checking admin status, and counting enquiries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useSubmitEnquiry.ts": "Defines a mutation to submit a new enquiry via the actor and invalidates the enquiries list on success.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables for themes, and typography using imported fonts.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminEnquiriesPage.tsx": "Admin page showing enquiry management UI with navigation and authentication guard.",
  "frontend/src/pages/HomePage.tsx": "Home page assembling main marketing sections like hero, about, classes, and enquiry form.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and enabling plugins.",
  "project_state.json": "Stores project metadata, implemented features, pending requests, and image requirements for the Orion Star Tuition Centre website."
}