{
  "backend/main.mo": "Motoko canister handling user profiles with access control and a full enquiry system including submission, admin viewing, deletion, pagination, and counting.",
  "feature_evidence.json": "Feature evidence report linking implemented features to source files, components, and test IDs with high-confidence mappings.",
  "frontend-file-summaries.txt": "Text file listing concise summaries of all frontend source files and their purposes.",
  "frontend/index.css": "Tailwind base styles defining color variables, dark mode tokens, and global element styling.",
  "frontend/index.html": "Basic HTML entry point mounting the app and loading the main client script.",
  "frontend/src/App.tsx": "Top-level React app configuring TanStack Router routes for home, admin, and contact pages within a themed layout.",
  "frontend/src/components/admin/EnquiriesList.tsx": "Admin UI component listing enquiries with formatted details and delete actions using React Query hooks.",
  "frontend/src/components/auth/AdminGuard.tsx": "Guard component enforcing Internet Identity login and admin checks before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication with loading states and query cache clearing.",
  "frontend/src/components/enquiry/EnquiryForm.tsx": "React enquiry form with validation, submission via hook, error handling, and success messaging.",
  "frontend/src/components/layout/Footer.tsx": "Footer with branding, quick navigation links, contact numbers, and social icons.",
  "frontend/src/components/layout/Header.tsx": "Header providing navigation, mobile menu toggle, and smooth scrolling to sections or contact page.",
  "frontend/src/components/sections/AboutSection.tsx": "About section showcasing key features of the tuition centre with cards and an illustration.",
  "frontend/src/components/sections/ClassesSubjectsSection.tsx": "Section listing class groups, descriptions, subjects offered, and themed cards for each level.",
  "frontend/src/components/sections/EnquirySection.tsx": "Section displaying enquiry heading and description, embedding the EnquiryForm component.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with title, intro text, call‑to‑action buttons, and decorative hero image.",
  "frontend/src/components/sections/TeachingApproachSection.tsx": "Renders the teaching approach section with a list of learning methods and an illustrative image.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useEnquiriesAdmin.ts": "Provides hooks for admin actions like fetching, deleting, and counting enquiries and checking admin status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useSubmitEnquiry.ts": "Defines a mutation hook to submit new enquiries and invalidate the enquiries list on success.",
  "frontend/src/index.css": "Sets up Tailwind base styles, color variables, typography, and global theming for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminEnquiriesPage.tsx": "Admin page that shows enquiry management UI with navigation and access control.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, office hours, and phone numbers in styled sections.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage by rendering hero, about, classes, teaching approach, and enquiry sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters (including hash routes) and persisting them in sessionStorage, with helpers to clear parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, spacing, typography, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project metadata describing implemented ICP dapp features, including React/Tailwind frontend, Motoko backend, enquiry flow, admin auth, and asset setup."
}