{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Contact page route and phone numbers in header/footer",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new public /contact route with clearly displayed click-to-call phone numbers.",
      "acceptanceCriteria": [
        "Visiting \"/contact\" shows both phone numbers exactly as provided: 8754585354 and 9677219328",
        "Each number is a clickable tel: link that opens the device dialer on supported devices",
        "All user-facing text on the Contact page is in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "create",
          "description": "Create a new public ContactPage that renders the tuition centre phone numbers \"8754585354\" and \"9677219328\" prominently, each as a tel: link, with English-only headings/labels."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new \"/contact\" route in the TanStack Router route tree and render the new ContactPage within the existing Layout (Header/Footer)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update header navigation so the Contact item navigates to /contact on desktop and mobile menus.",
      "acceptanceCriteria": [
        "The header includes a working navigation path to the Contact page at \"/contact\"",
        "Navigation works on both desktop and mobile header menus"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Update the existing header nav so the \"Contact\" item navigates to the \"/contact\" route (instead of scrolling to the \"enquiry\" section), and ensure the same behavior is applied for both desktop navigation and the mobile menu."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display the contact phone numbers in the footer 'Connect With Us' area site-wide with click-to-call links.",
      "acceptanceCriteria": [
        "The footer displays both numbers exactly as provided",
        "Numbers are clickable tel: links",
        "Footer layout remains visually consistent with existing styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Add the phone numbers \"8754585354\" and \"9677219328\" to the footer \"Connect With Us\" section as tel: links while keeping the existing footer styling and layout consistent."
        }
      ]
    }
  ]
}